**Instalação das Bibliotecas necessárias**

In [21]:
import pandas as pd
import sqlalchemy

In [22]:
!pip install pymysql

Requirement already satisfied: pymysql in c:\users\jose\appdata\local\programs\python\python36\lib\site-packages (0.9.3)

You are using pip version 18.1, however version 19.2.2 is available.
You should consider upgrading via the 'python -m pip install --upgrade pip' command.

In [9]:
python -m pip install --upgrade pip

SyntaxError: invalid syntax (<ipython-input-9-0a8cf7b99133>, line 1)

**Engine de Conexão ao Banco de Dados MYSQL**

Sintaxe:
engine = sqlalchemy.create_engine('mysql+drive://usuario:senha@ip-servidor:porta/banco-de-dados')

**Documentação do SQLAlchamy.**

https://docs.sqlalchemy.org/en/latest/core/engines.html

**Criando a Conexão**

In [32]:
engine = sqlalchemy.create_engine('mysql+pymysql://root@localhost:3306/drogaria',)

# Método: read_sql_table

**Paramêtros do método read_sql_table**

   * table_name - Nome da tabela onde será feita a leitura dos dados.
   * Con - Objeto conexão criado pelo SQLAlchamy.
   * Schema - Schema onde a tabela está armazenada.
   * Index_col = Coluna a ser definida como index.
   ...

**Lendo toda a tabela Funcionarios e transformando em DataFrame**

In [36]:
df = pd.read_sql_table('funcionarios', engine,index_col='id_funcionario')

**Listando os dados do banco de dados**

In [37]:
df.head()

                           cpf      funcao                  nome     senha
id_funcionario
2               460.457.928-82  Balconista           José Carlos  12345678
3               475.654.328-65  Balconista  Luis Felipe da Silva    123456

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2 entries, 2 to 3
Data columns (total 4 columns):
cpf       2 non-null object
funcao    2 non-null object
nome      2 non-null object
senha     2 non-null object
dtypes: object(4)
memory usage: 80.0+ bytes

**Lendo apenas algumas colunas**

In [42]:
df = pd.read_sql_table('funcionarios', engine,index_col='id_funcionario', columns=['id_funcionario', 'cpf'])

In [43]:
df.head()

                           cpf
id_funcionario
2               460.457.928-82
3               475.654.328-65

# Método: read_sql_query

* **Sql** - String SQL Query que deverá ser executada para retornar o conjunto de dados.
* **Con** - Objeto de conexão criado pelo SQLAlchemy.
* **Index_co** - Coluna a ser definida como index. 
* **Params** - Lista de paramêtros para serem passados ao método.

**Criando um DataFrame apartir de uma query de banco de dados**

In [55]:
df = pd.read_sql_query("select * from funcionarios", engine, index_col='id_funcionario')

In [56]:
df.head()

                           cpf      funcao                  nome     senha
id_funcionario
2               460.457.928-82  Balconista           José Carlos  12345678
3               475.654.328-65  Balconista  Luis Felipe da Silva    123456

**Criando um dataframe apartir de uma query ligando várias tabelas**

In [59]:
query = '''
SELECT * FROM FUNCIONARIOS AS F
INNER JOIN VENDAS AS V ON (V.FUNCIONARIO_ID_FUNCIONARIO = F.ID_FUNCIONARIO)
'''

In [60]:
df = pd.read_sql_query(query,engine)

In [61]:
df

,id_funcionario,cpf,funcao,nome,senha,id_vendas,horario,valor_total,funcionario_id_funcionario
0,2,460.457.928-82,Balconista,José Carlos,12345678,1,2019-08-14,500.0,2

**Criando um DataFrame apartir de uma query utlizando paramêtros dinâmicos.**

In [86]:
query = 'SELECT * FROM FUNCIONARIOS WHERE ID_FUNCIONARIO = %(id)s and funcao = %(nome)s'

In [87]:
df = pd.read_sql_query(query, engine, params={"id": 2, 
                                             "nome": 'Balconista'})

In [88]:
df

   id_funcionario             cpf      funcao         nome     senha
0               2  460.457.928-82  Balconista  José Carlos  12345678

# Método: read_sql

**Faz o roteamento entre os métodos read_table e read_sql_query**

* **Sql** - String SQL Query que deverá ser executada para retornar o conjunto de dados.
* **Con** - Objeto de conexão criado pelo SQLAlchemy.
* **Index_co** - Coluna a ser definida como index. 
* **Params** - Lista de paramêtros para serem passados ao método.

**Criando o DataFrame passando apenas o nome da tabela para o método**

In [89]:
df = pd.read_sql('funcionarios',engine)

In [90]:
df

   id_funcionario             cpf      funcao                  nome     senha
0               2  460.457.928-82  Balconista           José Carlos  12345678
1               3  475.654.328-65  Balconista  Luis Felipe da Silva    123456

# Método: to_sql

**Escreve o DataFrame para o Banco de dados Relacional**

**Carregando a base de dados e criando um DataFrame**

In [91]:
df = pd.read_csv('materiais-de-apoio-pandas-sql-banco-dados/automobile.csv')

In [92]:
df.head()

   symboling normalized-losses         make fuel-type aspiration
0          3                 ?  alfa-romero       gas        std
1          3                 ?  alfa-romero       gas        std
2          1                 ?  alfa-romero       gas        std
3          2               164         audi       gas        std
4          2               164         audi       gas        std

**Paramêtros do método to_sql**

* Name = Nome da tabela que será criada bo SGDB
* Con = Objeto conexão criada pelo SQLAlchamy
* Schema = Nome do Schema onde será criada a tabela.
* If_exists = Comportamento caso a tabela exista no SGBD 
* Index - Escreve o índice do DataFrame como uma coluna da tabela
* Index_label - Nome da coluna de índice

**Criando a tabela no Banco de Dados a partir do DataFrame**

In [93]:
df.to_sql(
    name = 'tb_automobile',
    con = engine,
    
)

**Criando a tabela no Banco de Dados sem a coluna de índice**

In [100]:
df.to_sql(
    name ='tb_automobile',
    con = engine, 
    index = False,
    if_exists='replace'
)